Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/port.h
#define PORT_PMUX_PMUXE_Pos                   _UINT8_(0)                                           /* (PORT_PMUX) Peripheral Multiplexing for Even-Numbered Pin Position */
#define PORT_PMUX_PMUXE_Msk                   (_UINT8_(0xF) << PORT_PMUX_PMUXE_Pos)                /* (PORT_PMUX) Peripheral Multiplexing for Even-Numbered Pin Mask */
#define PORT_PMUX_PMUXE(value)                (PORT_PMUX_PMUXE_Msk & (_UINT8_(value) << PORT_PMUX_PMUXE_Pos)) /* Assignment of value for PMUXE in the PORT_PMUX register */
#define   PORT_PMUX_PMUXE_A_Val               _UINT8_(0x0)                                         /* (PORT_PMUX) Peripheral function A selected  */
#define   PORT_PMUX_PMUXE_B_Val               _UINT8_(0x1)                                         /* (PORT_PMUX) Peripheral function B selected  */
#define   PORT_PMUX_PMUXE_D_Val               _UINT8_(0x3)                                         /* (PORT_PMUX) Peripheral function D selected  */
#define   PORT_PMUX_PMUXE_F_Val               _UINT8_(0x5)                                         /* (PORT_PMUX) Peripheral function F selected  */
#define   PORT_PMUX_PMUXE_H_Val               _UINT8_(0x7)                                         /* (PORT_PMUX) Peripheral function H selected  */
#define   PORT_PMUX_PMUXE_I_Val               _UINT8_(0x8)                                         /* (PORT_PMUX) Peripheral function I selected  */
#define   PORT_PMUX_PMUXE_K_Val               _UINT8_(0xA)                                         /* (PORT_PMUX) Peripheral function K selected  */
#define   PORT_PMUX_PMUXE_P_Val               _UINT8_(0xF)                                         /* (PORT_PMUX) Peripheral function P selected  */
#define PORT_PMUX_PMUXE_A                     (PORT_PMUX_PMUXE_A_Val << PORT_PMUX_PMUXE_Pos)       /* (PORT_PMUX) Peripheral function A selected Position */
#define PORT_PMUX_PMUXE_B                     (PORT_PMUX_PMUXE_B_Val << PORT_PMUX_PMUXE_Pos)       /* (PORT_PMUX) Peripheral function B selected Position */
#define PORT_PMUX_PMUXE_D                     (PORT_PMUX_PMUXE_D_Val << PORT_PMUX_PMUXE_Pos)       /* (PORT_PMUX) Peripheral function D selected Position */
#define PORT_PMUX_PMUXE_F                     (PORT_PMUX_PMUXE_F_Val << PORT_PMUX_PMUXE_Pos)       /* (PORT_PMUX) Peripheral function F selected Position */
#define PORT_PMUX_PMUXE_H                     (PORT_PMUX_PMUXE_H_Val << PORT_PMUX_PMUXE_Pos)       /* (PORT_PMUX) Peripheral function H selected Position */
#define PORT_PMUX_PMUXE_I                     (PORT_PMUX_PMUXE_I_Val << PORT_PMUX_PMUXE_Pos)       /* (PORT_PMUX) Peripheral function I selected Position */
#define PORT_PMUX_PMUXE_K                     (PORT_PMUX_PMUXE_K_Val << PORT_PMUX_PMUXE_Pos)       /* (PORT_PMUX) Peripheral function K selected Position */
#define PORT_PMUX_PMUXE_P                     (PORT_PMUX_PMUXE_P_Val << PORT_PMUX_PMUXE_Pos)       /* (PORT_PMUX) Peripheral function P selected Position */
#define PORT_PMUX_PMUXO_Pos                   _UINT8_(4)                                           /* (PORT_PMUX) Peripheral Multiplexing for Odd-Numbered Pin Position */
#define PORT_PMUX_PMUXO_Msk                   (_UINT8_(0xF) << PORT_PMUX_PMUXO_Pos)                /* (PORT_PMUX) Peripheral Multiplexing for Odd-Numbered Pin Mask */
#define PORT_PMUX_PMUXO(value)                (PORT_PMUX_PMUXO_Msk & (_UINT8_(value) << PORT_PMUX_PMUXO_Pos)) /* Assignment of value for PMUXO in the PORT_PMUX register */
#define   PORT_PMUX_PMUXO_A_Val               _UINT8_(0x0)                                         /* (PORT_PMUX) Peripheral function A selected  */
#define   PORT_PMUX_PMUXO_B_Val               _UINT8_(0x1)                                         /* (PORT_PMUX) Peripheral function B selected  */
#define   PORT_PMUX_PMUXO_D_Val               _UINT8_(0x3)                                         /* (PORT_PMUX) Peripheral function D selected  */
#define   PORT_PMUX_PMUXO_F_Val               _UINT8_(0x5)                                         /* (PORT_PMUX) Peripheral function F selected  */
#define   PORT_PMUX_PMUXO_H_Val               _UINT8_(0x7)                                         /* (PORT_PMUX) Peripheral function H selected  */
#define   PORT_PMUX_PMUXO_I_Val               _UINT8_(0x8)                                         /* (PORT_PMUX) Peripheral function I selected  */
#define   PORT_PMUX_PMUXO_K_Val               _UINT8_(0xA)                                         /* (PORT_PMUX) Peripheral function K selected  */
#define   PORT_PMUX_PMUXO_P_Val               _UINT8_(0xF)                                         /* (PORT_PMUX) Peripheral function P selected  */
#define PORT_PMUX_PMUXO_A                     (PORT_PMUX_PMUXO_A_Val << PORT_PMUX_PMUXO_Pos)       /* (PORT_PMUX) Peripheral function A selected Position */
#define PORT_PMUX_PMUXO_B                     (PORT_PMUX_PMUXO_B_Val << PORT_PMUX_PMUXO_Pos)       /* (PORT_PMUX) Peripheral function B selected Position */
#define PORT_PMUX_PMUXO_D                     (PORT_PMUX_PMUXO_D_Val << PORT_PMUX_PMUXO_Pos)       /* (PORT_PMUX) Peripheral function D selected Position */
#define PORT_PMUX_PMUXO_F                     (PORT_PMUX_PMUXO_F_Val << PORT_PMUX_PMUXO_Pos)       /* (PORT_PMUX) Peripheral function F selected Position */
#define PORT_PMUX_PMUXO_H                     (PORT_PMUX_PMUXO_H_Val << PORT_PMUX_PMUXO_Pos)       /* (PORT_PMUX) Peripheral function H selected Position */
#define PORT_PMUX_PMUXO_I                     (PORT_PMUX_PMUXO_I_Val << PORT_PMUX_PMUXO_Pos)       /* (PORT_PMUX) Peripheral function I selected Position */
#define PORT_PMUX_PMUXO_K                     (PORT_PMUX_PMUXO_K_Val << PORT_PMUX_PMUXO_Pos)       /* (PORT_PMUX) Peripheral function K selected Position */
#define PORT_PMUX_PMUXO_P                     (PORT_PMUX_PMUXO_P_Val << PORT_PMUX_PMUXO_Pos)       /* (PORT_PMUX) Peripheral function P selected Position */
#define PORT_PMUX_Msk                         _UINT8_(0xFF)                                        /* (PORT_PMUX) Register Mask  */


/* -------- PORT_PINCFG : (PORT Offset: 0x40) (R/W 8) Pin Configuration -------- */
#define PORT_PINCFG_RESETVALUE                _UINT8_(0x00)                                        /*  (PORT_PINCFG) Pin Configuration  Reset Value */

#define PORT_PINCFG_PMUXEN_Pos                _UINT8_(0)                                           /* (PORT_PINCFG) Peripheral Multiplexer Enable Position */
#define PORT_PINCFG_PMUXEN_Msk                (_UINT8_(0x1) << PORT_PINCFG_PMUXEN_Pos)             /* (PORT_PINCFG) Peripheral Multiplexer Enable Mask */
#define PORT_PINCFG_PMUXEN(value)             (PORT_PINCFG_PMUXEN_Msk & (_UINT8_(value) << PORT_PINCFG_PMUXEN_Pos)) /* Assignment of value for PMUXEN in the PORT_PINCFG register */
#define PORT_PINCFG_INEN_Pos                  _UINT8_(1)                                           /* (PORT_PINCFG) Input Enable Position */
#define PORT_PINCFG_INEN_Msk                  (_UINT8_(0x1) << PORT_PINCFG_INEN_Pos)               /* (PORT_PINCFG) Input Enable Mask */
#define PORT_PINCFG_INEN(value)               (PORT_PINCFG_INEN_Msk & (_UINT8_(value) << PORT_PINCFG_INEN_Pos)) /* Assignment of value for INEN in the PORT_PINCFG register */
#define PORT_PINCFG_PULLEN_Pos                _UINT8_(2)                                           /* (PORT_PINCFG) Pull Enable Position */
#define PORT_PINCFG_PULLEN_Msk                (_UINT8_(0x1) << PORT_PINCFG_PULLEN_Pos)             /* (PORT_PINCFG) Pull Enable Mask */
#define PORT_PINCFG_PULLEN(value)             (PORT_PINCFG_PULLEN_Msk & (_UINT8_(value) << PORT_PINCFG_PULLEN_Pos)) /* Assignment of value for PULLEN in the PORT_PINCFG register */
#define PORT_PINCFG_ODRAIN_Pos                _UINT8_(3)                                           /* (PORT_PINCFG) Open Drain Output Position */
#define PORT_PINCFG_ODRAIN_Msk                (_UINT8_(0x1) << PORT_PINCFG_ODRAIN_Pos)             /* (PORT_PINCFG) Open Drain Output Mask */
#define PORT_PINCFG_ODRAIN(value)             (PORT_PINCFG_ODRAIN_Msk & (_UINT8_(value) << PORT_PINCFG_ODRAIN_Pos)) /* Assignment of value for ODRAIN in the PORT_PINCFG register */
#define PORT_PINCFG_SLEWLIM_Pos               _UINT8_(4)                                           /* (PORT_PINCFG) Output Driver Slew Rate Selection Position */
#define PORT_PINCFG_SLEWLIM_Msk               (_UINT8_(0x3) << PORT_PINCFG_SLEWLIM_Pos)            /* (PORT_PINCFG) Output Driver Slew Rate Selection Mask */
#define PORT_PINCFG_SLEWLIM(value)            (PORT_PINCFG_SLEWLIM_Msk & (_UINT8_(value) << PORT_PINCFG_SLEWLIM_Pos)) /* Assignment of value for SLEWLIM in the PORT_PINCFG register */
#define   PORT_PINCFG_SLEWLIM_FAST_Val        _UINT8_(0x0)                                         /* (PORT_PINCFG) Slew rate control disabled (fast rise/fall time operation)  */
#define   PORT_PINCFG_SLEWLIM_SLOW4_Val       _UINT8_(0x1)                                         /* (PORT_PINCFG) Slew rate control enabled (4x slower)  */
#define   PORT_PINCFG_SLEWLIM_SLOW8_Val       _UINT8_(0x2)                                         /* (PORT_PINCFG) Slew rate control enabled (8x slower)  */
#define   PORT_PINCFG_SLEWLIM_SLOW12_Val      _UINT8_(0x3)                                         /* (PORT_PINCFG) Slew rate control enabled (12x slower)  */
#define PORT_PINCFG_SLEWLIM_FAST              (PORT_PINCFG_SLEWLIM_FAST_Val << PORT_PINCFG_SLEWLIM_Pos) /* (PORT_PINCFG) Slew rate control disabled (fast rise/fall time operation) Position */
#define PORT_PINCFG_SLEWLIM_SLOW4             (PORT_PINCFG_SLEWLIM_SLOW4_Val << PORT_PINCFG_SLEWLIM_Pos) /* (PORT_PINCFG) Slew rate control enabled (4x slower) Position */
#define PORT_PINCFG_SLEWLIM_SLOW8             (PORT_PINCFG_SLEWLIM_SLOW8_Val << PORT_PINCFG_SLEWLIM_Pos) /* (PORT_PINCFG) Slew rate control enabled (8x slower) Position */
#define PORT_PINCFG_SLEWLIM_SLOW12            (PORT_PINCFG_SLEWLIM_SLOW12_Val << PORT_PINCFG_SLEWLIM_Pos) /* (PORT_PINCFG) Slew rate control enabled (12x slower) Position */
#define PORT_PINCFG_Msk                       _UINT8_(0x3F)                                        /* (PORT_PINCFG) Register Mask  */


/* -------- PORT_INTENCLR : (PORT Offset: 0x60) (R/W 32) Interrupt Enable Clear -------- */
#define PORT_INTENCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (PORT_INTENCLR) Interrupt Enable Clear  Reset Value */

#define PORT_INTENCLR_NSCHK_Pos               _UINT32_(0)                                          /* (PORT_INTENCLR) Non-Secure Check Interrupt Enable Position */
#define PORT_INTENCLR_NSCHK_Msk               (_UINT32_(0x1) << PORT_INTENCLR_NSCHK_Pos)           /* (PORT_INTENCLR) Non-Secure Check Interrupt Enable Mask */
#define PORT_INTENCLR_NSCHK(value)            (PORT_INTENCLR_NSCHK_Msk & (_UINT32_(value) << PORT_INTENCLR_NSCHK_Pos)) /* Assignment of value for NSCHK in the PORT_INTENCLR register */
#define PORT_INTENCLR_Msk                     _UINT32_(0x00000001)                                 /* (PORT_INTENCLR) Register Mask  */


